---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ParameterChangeNotAffectingGeometry
source: html/800a0aad-d595-6380-ae8e-6e25e6ae8899.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ParameterChangeNotAffectingGeometry Property

Changing this element's parameter has no effect on its current position or geometry. Check to see if the element is constrained either in the project view or in the element's sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId ParameterChangeNotAffectingGeometry { get; }
```